Tekla Open API Reference for Tekla Structures 2025
CannotLoadAttributesException Class
 The CannotLoadAttributesException class defines the exception that is thrown when the loading of attributes failed.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotLoadAttributesException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotLoadAttributesException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotLoadAttributesException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotLoadAttributesException type exposes the following members.
Constructors
Name | Description
CannotLoadAttributesException
 Creates a new cannot load attributes exception instance.
Top
Fields
Name | Description
AttributeFile
The name of the attribute file that was being loaded.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace